interface var06 {

  public double logika(double d1, double d2, double d3);
  // Даны три числа. Выдать порядковый номер меньшего из них.

  public void poka(int N);
  // Дано целое число N (> 0). Используя операции деления нацело и взятия
  // остатка от деления, найти число, полученное при прочтении
  // числа N справа налево.

  public void massivy(double[] A);
  // Найти номер первого локального минимума массива A (локальный
  // минимум - это элемент, который меньше своего левого и правого соседей).

}